# HeroesOfPymoli

In [622]:
from IPython.display import display
#extract the filename to be read and analyzed
import os
filename = os.path.join("Resources", "purchase_data.csv")

In [3]:
import pandas as pd
df = pd.read_csv(filename)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Total number of Players

In [649]:
pd.DataFrame({"Total Players": [df["SN"].unique().size]})

   Total Players
0            576

## Purchasing Analysis (Total)

* Number of Unique Items
* Total Number of Purchases
* Total Revenue
* Average Purchase Price

In [693]:
df1= df["Price"].agg({"Total Number of Purchases":'count',"Total Revenue": 'sum', "Average Purchase Price":'mean'}).to_frame().T.reset_index(drop=True)

df2 = pd.DataFrame({"Number of Unique Items" : [df["Item ID"].nunique()]})

df2.join(df1)

,Number of Unique Items,Total Number of Purchases,Total Revenue,Average Purchase Price
0,183,780.0,2379.77,3.050987

## Gender Demographics

* Count of Female, Male and Other Players

In [632]:
#df_male = df[df["Gender"] == "Male"].agg(['count', 'percentage'])
df.groupby(["Gender"])["SN"].nunique()

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

* Percentage of Female, Male and Other Players

In [510]:
(df.groupby(["Gender"])["SN"].nunique())*100/df.groupby(["Gender"])["SN"].nunique().sum()

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: SN, dtype: float64

## Purchasing Analysis (Gender)

### Purchase Count
### Average Purchase Price
### Total Purchase Value

In [609]:
df.groupby(['Gender'])["Price"]\
.agg(['count', 'mean', 'sum'])

                       count      mean      sum
Gender
Female                   113  3.203009   361.94
Male                     652  3.017853  1967.64
Other / Non-Disclosed     15  3.346000    50.19

### Average Purchase Total per Person by Gender

In [563]:
df.groupby(['Gender'])["Price"].sum()/df.groupby(['Gender'])["SN"].nunique()

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

## Age Demographics

 The below each broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.)
* Purchase Count
* Average Purchase Price
* Total Purchase Value

In [926]:
bins = pd.cut(df['Age'],  [0, 9, 14, 19,24,29,34, 39, 44,49 ])

df_new = df.groupby(bins)['Price'].agg(['count', 'mean','sum'])
df_new

          count      mean      sum
Age
(0, 9]       23  3.353478    77.13
(9, 14]      28  2.956429    82.78
(14, 19]    136  3.035956   412.89
(19, 24]    365  3.052219  1114.06
(24, 29]    101  2.900990   293.00
(29, 34]     73  2.931507   214.00
(34, 39]     41  3.601707   147.67
(39, 44]     12  3.045000    36.54
(44, 49]      1  1.700000     1.70

* Average Purchase Total per Person by Age Group

In [927]:
avrg_pur_total_per_person = (df.groupby([bins, 'Gender'])['Price'].sum()/df.groupby([bins, 'Gender'])["SN"].nunique()).rename("Average")
avrg_pur_total_per_person[:]

Age       Gender
(0, 9]    Female                   4.547500
          Male                     4.533846
          Other / Non-Disclosed         NaN
(9, 14]   Female                   3.606667
          Male                     3.787368
          Other / Non-Disclosed         NaN
(14, 19]  Female                   4.880000
          Male                     3.698140
          Other / Non-Disclosed    2.972500
(19, 24]  Female                   4.387750
          Male                     4.298879
          Other / Non-Disclosed    4.647500
(24, 29]  Female                   4.960000
          Male                     3.647647
          Other / Non-Disclosed    5.280000
(29, 34]  Female                   3.944000
          Male                     4.133617
          Other / Non-Disclosed         NaN
(34, 39]  Female                   3.553333
          Male                     4.714615
          Other / Non-Disclosed    7.215000
(39, 44]  Female                   4.400000
          Male                     3.214000
          Other / Non-Disclosed         NaN
(44, 49]  Female                        NaN
          Male                     1.700000
          Other / Non-Disclosed         NaN
Name: Average, dtype: float64

### Top Spenders
#### Identify the the top 5 spenders in the game by total purchase value, then list (in a table):
* SN
* Purchase Count
* Average Purchase Price
* Total Purchase Value

In [747]:
df.groupby(["SN"])["Price"].agg(['count','mean', 'sum']).sort_values(by = "sum", ascending = False)[0:5]

             count      mean    sum
SN
Lisosia93        5  3.792000  18.96
Idastidru52      4  3.862500  15.45
Chamjask73       3  4.610000  13.83
Iral74           4  3.405000  13.62
Iskadarya95      3  4.366667  13.10

### Most Popular Items
#### Identify the 5 most popular items by purchase count, then list (in a table):
* Item ID
* Item Name
* Purchase Count
* Item Price
* Total Purchase Value

In [890]:
df_1 = df.groupby('Item ID')['Price'].agg(['count', 'sum']).sort_values(by = 'count', ascending = False)[0:5]

                                                      count    sum
Item Name                                    Item ID
Oathbreaker, Last Hope of the Breaking Storm 178         12  50.76
Extraction, Quickblade Of Trembling Hands    108          9  31.77
Nirvana                                      82           9  44.10
Fiery Glass Crusader                         145          9  41.22
Pursuit, Cudgel of Necromancy                19           8   8.16

In [919]:
df_2 = pd.merge(df_1, df, on="Item ID")
df_2.groupby('Item ID')["Item ID", "count", 'sum', 'Item Name', 'Price'].apply(lambda x:x).drop_duplicates()

    Item ID  count    sum                                     Item Name  Price
0       178     12  50.76  Oathbreaker, Last Hope of the Breaking Storm   4.23
12      145      9  41.22                          Fiery Glass Crusader   4.58
21      108      9  31.77     Extraction, Quickblade Of Trembling Hands   3.53
30       82      9  44.10                                       Nirvana   4.90
39       19      8   8.16                 Pursuit, Cudgel of Necromancy   1.02

### Most Profitable Items
#### Identify the 5 most profitable items by total purchase value, then list (in a table):
* Item ID
* Item Name
* Purchase Count
* Item Price
* Total Purchase Value

In [925]:
df_3 = df.groupby('Item ID')['Price'].agg(['count', 'sum']).sort_values(by = 'sum', ascending = False)[0:5]
(pd.merge(df_3, df, on="Item ID")).groupby('Item ID')["Item ID", "count", 'sum', 'Item Name', 'Price'].apply(lambda x:x).drop_duplicates()

    Item ID  count    sum                                     Item Name  Price
0       178     12  50.76  Oathbreaker, Last Hope of the Breaking Storm   4.23
12       82      9  44.10                                       Nirvana   4.90
21      145      9  41.22                          Fiery Glass Crusader   4.58
30       92      8  39.04                                  Final Critic   4.88
38      103      8  34.80                                Singed Scalpel   4.35